senserf/picos/PicOS/MSP430/main.c
/*
	Copyright 2002-2020 (C) Olsonet Communications Corporation
	Programmed by Pawel Gburzynski & Wlodek Olesinski
	All rights reserved

	This file is part of the PICOS platform

*/
#include "kernel.h"
#include "storage.h"


#include "irq_timer_headers.h"

extern 	__pi_pcb_t	*__pi_curr;
extern 	address		__pi_utims [MAX_UTIMERS];

lword 	__pi_nseconds;

void	__pi_malloc_init (void);

/* ========================== */
/* Device driver initializers */
/* ========================== */

#if	UART_DRIVER || UART_TCV

static void preinit_uart (void);

#if	UART_DRIVER

#define	N_UARTS	UART_DRIVER

static void	devinit_uart (int);

#else	/* UART_DRIVER */

#define	N_UARTS	UART_TCV

#endif	/* UART_DRIVER */

// ============================================================================
// This is clumsy. We need a way to make the second UART configurable
// dynamically, as it can be shared with SPI, so we need it as a formal
// device, but we don't want the preinit, freeze, auto enable/disable, etc.
// ============================================================================

#if N_UARTS < 2
// This is defined in mach.h, but can be undef'ed, e.g., from options.sys
#ifdef	UART_PREINIT_B
#undef	UART_PREINIT_B
#endif
#endif

// ============================================================================

#endif  /* UART_DRIVER || UART_TCV */

#if MAX_DEVICES

// On MSP430, UART is the only "device" (a good reason to get rid of the
// concept)

const static devinit_t devinit [MAX_DEVICES] = {
/* === */
#if	UART_DRIVER
		{ devinit_uart,	 0 },
#else
		{ NULL, 0 },
#endif
/* === */
#if	MAX_DEVICES > 1
#if	UART_DRIVER > 1
		{ devinit_uart,	 1 },
#else
		{ NULL, 0 }
#endif
#endif	/* MAX_DEVICES > 1 */
	 };

#endif	/* MAX_DEVICES */

static void ssm_init (void), mem_init (void), ios_init (void);

void reset (void) {

	cli_tim;

// EEPROM/SD panic ============================================================

#ifdef	EEPROM_PRESENT
	ee_panic ();
#endif
#ifdef	SDCARD_PRESENT
	sd_panic ();
#endif

// ============================================================================

	while (1) 
		hard_reset;
}

void halt (void) {

	cli_tim;
	diag ("PicOS halted");
	mdelay (500);
	while (1)
		_BIS_SR (LPM4_bits);
}

int main (void) {

#if	STACK_GUARD
	{ register word i;
	for (i = 0; i < (STACK_SIZE / sizeof (word)); i++)
		// This leaves out one word at the very bottom, but that's
		// fine
		*((((address)STACK_END) - 1) + i) = STACK_SENTINEL;
	}
#endif
	/* Initialization */
	ssm_init ();
	// mdelay (1);
	mem_init ();
	// mdelay (1);
	ios_init ();

#if	TCV_PRESENT
	tcv_init ();
#endif
	// Assume root process identity
	__pi_curr = (__pi_pcb_t*) fork (root, 0);
	// Delay root startup for 16 msec to make sure that the drivers go
	// first
	delay (16, 0);

	powerup ();

#if TRIPLE_CLOCK == 0
	// Start the clock; no need to do that in TRIPLE_CLOCK mode where the
	// clock is started explicitly by delay requests
	sti_tim;
#endif
	// We are up and running
	sti;

	// Fall through to scheduler

#include "scheduler.h"

}

#if DIAG_MESSAGES > 1
void __pi_syserror (word ec, const char *m) {

	WATCHDOG_STOP;

#if	DUMP_MEMORY
	dmp_mem ();
#endif
	diag ("SYSERR: %x, %s", ec, m);
#else
void __pi_syserror (word ec) {

	WATCHDOG_STOP;

	dbg_0 (ec); // SYSTEM ERROR
	diag ("SYSERR: %x", ec);
#endif
	cli;

#if RESET_ON_SYSERR

#if LEDS_DRIVER
	for (__pi_mintk = 0; __pi_mintk < 32; __pi_mintk++)
		all_leds_blink;
#endif
	reset ();

#else	/* RESET_ON_SYSERR */

// ============================================================================

	while (1) {
#if LEDS_DRIVER
		all_leds_blink;
#else
		_BIS_SR (LPM4_bits);
#endif
	}
#endif	/* RESET_ON_SYSERR */
}

// ============================================================================
// ssm_init ===================================================================
// ============================================================================

#ifdef	PIN_PORTMAP

static const portmap_t portmap [] = PIN_PORTMAP;

#define	n_portmap (sizeof (portmap) / sizeof (portmap_t))

#endif

// ============================================================================

static void ssm_init () {

	// Disable watchdog timer
	WATCHDOG_STOP;

#include "portinit.h"

// ===========================================================================
// Clock setup ===============================================================
// ===========================================================================

#ifndef	MCLOCK_FROM_CRYSTAL
#define	MCLOCK_FROM_CRYSTAL	0
#endif

#ifdef	__MSP430_1xx__

// ===========================================================================

#if MCLOCK_FROM_CRYSTAL == 0

	// DCO: select maximum frequency
	DCOCTL = DCO2 + DCO1 + DCO0;
	BCSCTL1 = RSEL2 + RSEL1 + RSEL0 + XT2OFF

#if	CRYSTAL_RATE != 32768
	// We are using a high-speed crystal for XT1
		+ XTS
#endif
	;
	// Measured MCLK is ca. 4.5 MHz

// This is in kHz
#define	CPU_CLOCK_RATE	4500

#if 	CRYSTAL2_RATE
	// Assign SMCLK to XTL2
	BCSCTL2 = SELM_DCOCLK | SELS;
#endif

#endif	/* MCLOCK_FROM_CRYSTAL == 0 */

// ===========================================================================

#if MCLOCK_FROM_CRYSTAL	== 1

#if CRYSTAL_RATE < 4000000
#error "S: CRYSTAL_RATE must be >= 4000000 for MCLOCK_FROM_CRYSTAL == 1"
#endif

// Clock from crystal 1

	BCSCTL1 |= XTS;
	do {
		_BIC (IFG1, OFIFG);
		udelay (100);
	} while ((IFG1 & OFIFG) != 0);

  	BCSCTL2 = SELM1 + SELM0

#if CRYSTAL2_RATE > CRYSTAL_RATE
	// Assign SMCLK to XTL2
		+ SELS
#endif
	; 

#define	CPU_CLOCK_RATE	(CRYSTAL_RATE / 1000)

#endif	/* MCLOCK_FROM_CRYSTAL == 1 */

// ===========================================================================

#if MCLOCK_FROM_CRYSTAL == 2

#if CRYSTAL2_RATE == 0
#error "S: Need XT2 for MCLOCK_FROM_CRYSTAL == 2"
#endif
	// Clock from crystal 2: make sure the second oscillator is running
	_BIC_SR (LPM4_bits);

	// Make sure XT2 is enabled
	BCSCTL1 = 0;

	do {
		_BIC (IFG1, OFIFG);
		udelay (100);
	} while ((IFG1 & OFIFG) != 0);

	// SELS is not needed, I think
	BCSCTL2 = SELM1 | SELS; 

#define	CPU_CLOCK_RATE	(CRYSTAL2_RATE / 1000)

#endif	/* MCLOCK_FROM_CRYSTAL == 2 */

#endif	/* 1xx */

