senserf/picos/PicOS/MSP430/main.c
// ===========================================================================
// ===========================================================================
// ===========================================================================

#ifdef	__MSP430_4xx__

// The FLL variant

#ifndef	XCAPACITY
#define	XCAPACITY	XCAP10PF
#endif

#if CRYSTAL_RATE != 32768
#define	__XTS	XTS_FLL
#else
#define	__XTS	0
#endif

#if MCLOCK_FROM_CRYSTAL == 0

// MCLOCK from DCO driven by crystal 1

#define	__scfqctl_set (8000000/CRYSTAL_RATE)

#if __scfqctl_set > 128
	FLL_CTL0 = DCOPLUS + XCAPACITY + __XTS;
   	SCFQCTL = (__scfqctl_set/2) - 1;
#define	CPU_CLOCK_RATE	(((__scfqctl_set/2) * 2 * CRYSTAL_RATE) / 1000)
#else
	FLL_CTL0 = XCAPACITY + __XTS;
   	SCFQCTL = __scfqctl_set - 1;
#define	CPU_CLOCK_RATE	(((__scfqctl_set) * 2 * CRYSTAL_RATE) / 1000)
#endif

// MCLK from DCO
#define	__SELM	SELM0

#endif	/* MCLOCK_FROM_CRYSTAL == 0 */

// ===========================================================================

#if MCLOCK_FROM_CRYSTAL == 1

// MCLOCK driven directly by crystal 1

#if CRYSTAL_RATE < 4000000
#error "S: CRYSTAL_RATE must be >= 4000000 for MCLOCK_FROM_CRYSTAL == 1"
#endif
	FLL_CTL0 = XCAP0PF + __XTS;

#define	CPU_CLOCK_RATE	(CRYSTAL_RATE / 1000)

// This is the default

// MCLK from crystal 1
#define	__SELM	SELM3

#endif /* MCLOCK_FROM_CRYSTAL == 1 */

// ===========================================================================

#if MCLOCK_FROM_CRYSTAL == 2

// MCLOCK driven directly by crystal 2

#if CRYSTAL2_RATE == 0
#error "S: Need XT2 for MCLOCK_FROM_CRYSTAL == 2"
#endif
	FLL_CTL0 = XCAP0PF + __XTS;

	// Disable DCO
	_BIS_SR(SCG1);

	_BIC (FLL_CTL1, XT2OFF);

	do {
		_BIC (IFG1, OFIFG);	// Clear fault flag
		udelay (100);
	} while ((IFG1 & OFIFG) != 0);

#define	CPU_CLOCK_RATE	(CRYSTAL2_RATE / 1000)

// MCLK from crystal 2
#define	__SELM	(SELM2 + SELS)

#endif /* MCLOCK_FROM_CRYSTAL == 2 */

// ===========================================================================

	FLL_CTL1 = __SELM

#if CRYSTAL2_RATE == 0
		+ XT2OFF
#endif
	;

// ===========================================================================
#if 0
	//
	// This is the best I could get through rather tedious experiments
	//
	SCFQCTL = 63;			// ACLK * 64 = 32768 * 64 = 2097152 Hz
	SCFI0 =	FLLD_2 | FN_2;		// ... * 2 = 4,194,304
	// SCFI0 =	FLLD_4 | FN_3;	// ... * 4 = 8,388,608 Hz, (2 -- 17.9)
	_BIS (FLL_CTL0, DCOPLUS);	// Mutiplier active
	// This yields 4MHz + for the CPU clock
#endif	/* 0 -- was 449 */

#endif	/* 4xx */

// ===========================================================================
// ===========================================================================
// ===========================================================================

#if defined(__MSP430_6xx__) || defined(__MSP430_5xx__)

#ifndef	PMM_LEVEL
#define	PMM_LEVEL	3
#endif

#if PMM_LEVEL < 0 || PMM_LEVEL > 3
#error "S: PMM_LEVEL must be between 0 and 3!!"
#endif

#if	PMM_LEVEL
// Note: we may need a general function for this (later)

	{
		word hun, one;

		hun = one = 0;

		do {

			hun += SVSHRVL0;	// 0x0100
			one += PMMCOREV0;	// 0x0001

			// Unlock the module
			PMMCTL0_H = PMMPW_H;
			// SVS/M high side to new level
			SVSMHCTL = SVSHE + hun + SVMHE + one;
			// SVM new level
  			SVSMLCTL = SVSLE + SVMLE + one;
			// Delay until settled
  			while ((PMMIFG & SVSMLDLYIFG) == 0);
			// Clear already set flags
  			PMMIFG &= ~(SVMLVLRIFG + SVMLIFG);
			// VCore level
  			PMMCTL0_L = (byte) one;
  			if ((PMMIFG & SVMLIFG))
				// Wait until level reached
    				while ((PMMIFG & SVMLVLRIFG) == 0);
			// Set SVS/M low side to new level
  			SVSMLCTL = SVSLE + hun + SVMLE + one;
			// Done for this step
			PMMCTL0_H = 0x00;

		} while (one < PMM_LEVEL);
	}

#endif	/* PMM_LEVEL */

	// High power request from module enable
	PMMCTL0_H  = PMMPW_H;
	// Needed (among others) by on-chip CC1101
	PMMCTL0_L |= PMMHPMRE;
	PMMCTL0_H  = 0x00;	

#if CRYSTAL_RATE != 32768
#error "S: the LF crystal must be 32768Hz!!"
#endif

#ifndef	LF_CRYSTAL_ABSENT
#define	LF_CRYSTAL_ABSENT	0
#endif

#if LF_CRYSTAL_ABSENT

	// No LF crystal, use internal 32KHz oscillator (as an acting crystal)

#define	_SELREF	SELREF__REFOCLK
#define	_SELA	SELA__REFOCLK

#else

	// LF crystal present

#define	_SELREF	SELREF__XT1CLK
#define	_SELA	SELA__XT1CLK

#ifndef	UCS_XT1DRIVE
#define	UCS_XT1DRIVE	0
#endif
	// Enable 32kHz crystal ACLK; note: GP pins may have to be selected
	// properly for that; we assume that the appropriate PIN_DEFAULT_PxSEL
	// is set as required in board_pins.h

	UCSCTL6 &= ~XT1OFF;

#if UCS_XT1DRIVE < 0 || UCS_XT1DRIVE > 3
#error "S: UCS_XT1DRIVE must be between 0 and 3!!"
#endif

	UCSCTL6 |= (XCAP_3 | (UCS_XT1DRIVE << 6));

#endif	/* Crystal absent or present */

#define	CPU_CLOCK_RATE	12000

	_BIS_SR(SCG0);             // Disable the FLL control loop

	// The CPU clock rate is determined by FLL_DIVIDER and DCO_MULTIPLIER
	// (see mach.h) as ((DCO_MULTIPLIER + 1) * 32768 * D) / 2, where D
	// is determined from FLL_DIVIDER bits: 0-1, 1-2, 2-4, 3-8, ..., e.g.,
	// FLLD_1 and 366 yield (2 * 367 * 32768)/2 = 12025856

	UCSCTL3 = _SELREF;	   // FLL reference
	UCSCTL4 = _SELA | SELS__DCOCLKDIV | SELM__DCOCLKDIV;      
	
	UCSCTL0 = 0x0000;          // Set lowest possible DCOx, MODx
	UCSCTL1 = DCORSEL_5;       // Select suitable range (depends on freq)
	UCSCTL2 = FLL_DIVIDER + DCO_MULTIPLIER;  // 12,025,856 Hz

	_BIC_SR(SCG0);             // Enable the FLL control loop

    	// Worst-case settling time for the DCO when the DCO range bits have
	// been changed is n x 32 x 32 x f_MCLK / f_FLL_reference. See UCS
	// chapter in 5xx UG for optimization.
    	// 32 x 32 x 8 MHz / 32,768 Hz = 250000 = MCLK cycles for DCO to settle
	udelay (250);
	// Loop until XT1 & DCO stabilizes, make sure to execute at least once
	do {
        	UCSCTL7 &= ~(XT2OFFG + XT1LFOFFG + XT1HFOFFG + DCOFFG);
		SFRIFG1 &= ~OFIFG; // Clear fault flags

	} while ((SFRIFG1 & OFIFG));	

#ifdef	PIN_PORTMAP
	{
		word i, j;

		PMAPPWD = PMAPPW;
		// To allow future reconfigurations
		PMAPCTL = PMAPRECFG;

