senserf/picos/PicOS/MSP430/main.c
		for (i = 0; i < n_portmap; i++)
			for (j = 0; j < 8; j++)
				*((portmap [i] . pm_base) + j) =
					portmap [i] . map [j];
		PMAPPWD = 0;
	}
#endif	/* PIN_PORTMAP */

#endif	/* __MSP430_6xx__ */

// ===========================================================================
// ===========================================================================
// ===========================================================================

	// System timer (assumes TASSEL0/TACLR is same as TBSSEL0/TBCLR)
	// Source is ACLK, divided by 8 (4096 ticks/sec)

#if TRIPLE_CLOCK
	// Continuous mode
	TCI_CTL = TASSEL0 | TACLR | ID0 | ID1 | MC1;
	TCI_CCS = (word) TCI_SEC_DIV;
	sti_sec;
	sti_aux;
#else
	// Up mode
	TCI_CTL = TASSEL0 | TACLR | ID0 | ID1 | MC0;
#endif

}

void setpowermode (word m) {
//
// Only one level of PD
//
	if (m) {

		__pi_systat.pdmode = 1;
		clockdown ();
#if CRYSTAL2_RATE
		// Disable XTL2
		_BIS (BCSCTL1, XT2OFF);
#endif
	} else {

#if CRYSTAL2_RATE
		// Enable XTL2
		_BIC (BCSCTL1, XT2OFF);
#endif
		clockup ();
		__pi_systat.pdmode = 0;
	}
}

#define	mkmk_eval
void udelay (register word n) {
/* =================================== */
/* n should be roughly in microseconds */
/* =================================== */
	__asm__ __volatile__ (
		"1:\n"
#if CPU_CLOCK_RATE > 2000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 4000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 6000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 7000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 8200
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 9400
		"nop\n"
#endif
#if CPU_CLOCK_RATE > 10600
		"nop\n"
#endif
#if CPU_CLOCK_RATE > 11800
		"nop\n"
#endif
		" dec %[n]\n"
		" jne 1b\n"
			: [n] "+r"(n));
}
#undef	mkmk_eval

void mdelay (word n) {
/* ============ */
/* milliseconds */
/* ============ */
	while (n--)
		udelay (995);
}

// ============================================================================

#if TRIPLE_CLOCK

// ============================================================================
// Version with two clocks and circular timer counter; note that
// HIGH_CRYSTAL_RATE == 0, as the two cannot be set together
// ============================================================================

static word setdel = 0;		// Interval for which the delay timer was set

static word gettav () {
//
// Majority vote read for the timer value (which we are not supposed to read)
//
	word del;

	while (1) {
		del = TCI_VAL;
		if (TCI_VAL == del && TCI_VAL == del && TCI_VAL == del)
			return del;
	}
}

void tci_run_delay_timer () {
//
// Set the delay timer according to __pi_mintk
//
	word d;

	// cli_tim;	// This should be redundant

	// Time to elapse in msecs
	d = __pi_mintk - __pi_old;

	// Don't exceed the maximum
	setdel = (d > TCI_MAXDEL) ? TCI_MAXDEL : d;

	TCI_CCR = gettav () + TCI_DELTOTICKS (setdel);
	sti_tim;
}

void tci_run_auxiliary_timer () {
//
// Start the auxiliary timer
//
	cli_aux;	// In case we are only resetting
	TCI_CCA = gettav () + TCI_HIGH_DIV;
	sti_aux;
}

word tci_update_delay_ticks (Boolean force) {
//
// Called to stop the timer, if running, and tally up the ticks
//
	cli_tim;
	if (setdel) {
		// The timer has been running, otherwise we don't have to
		// bother; force tells whether we have to stop the timer (e.g.,
		// catering to a new delay request), or whether we are just
		// checking; if !force, and the timer is running, just let
		// it go and return YES, to tell update_n_wake to exit;
		// when we return NO, it means that we actually have to
		// examine the delay queue; in such a case, the timer will
		// be restarted later
		if (force) {
			// the role of the 3 is to round it up, such that the
			// estimate will tend to err on the low side,
			// which will make sure that the measured delay is
			// never less than asked for
			__pi_new +=
			    setdel - TCI_TICKSTODEL (TCI_CCR - gettav () + 3);
			// Use it only once
			setdel = 0;
			goto EX;
		}
		sti_tim;
		return YES;
	}
EX:
	return NO;
}
		
// ============================================================================
// Timer interrupts for the triple-clock version ==============================
// ============================================================================

interrupt (TCI_VECTOR_S) timer_auxiliary () {
//
// Two in one: one of them runs exactly every second and is used to maintain
// a precise seconds clock; the other is used for utimers, debouncing,
// blinking leds, and other stuff registered in irq_timer.h.
//
	word aux_timer_inactive;

	// This test also removes the interrupt status
	if (TCI_AUXILIARY_TIMER_INTERRUPT) {

		// Set for the next tick - as quickly as possible
		TCI_CCA += TCI_HIGH_DIV;
		// Flag == should we continue?
		aux_timer_inactive = 1;
		// Take care of utimers
		if (__pi_utims [0] == 0)
			goto EUT;
		if (*(__pi_utims [0])) {
			(*(__pi_utims [0]))--;
			aux_timer_inactive = 0;
		}
		if (__pi_utims [1] == 0)
			goto EUT;
		if (*(__pi_utims [1])) {
			(*(__pi_utims [1]))--;
			aux_timer_inactive = 0;
		}
		if (__pi_utims [2] == 0)
			goto EUT;
		if (*(__pi_utims [2])) {
			(*(__pi_utims [2]))--;
			aux_timer_inactive = 0;
		}
		if (__pi_utims [3] != 0) {
			if (*(__pi_utims [3])) {
				(*(__pi_utims [3]))--;
				aux_timer_inactive = 0;
			}
		}
EUT:
// ============================================================================
#include "irq_timer.h"
// ============================================================================
		if (aux_timer_inactive)
			// Nobody wants us
			cli_aux;

		RTNI;
	}

	// This is the seconds clock. By default it ticks at 1 sec, which is
	// mostly OK. If we are really obsessive about power savings, the rate
	// of the clock can be reduced by setting SECOND_CLOCK_RATE to a value
	// higher than 1, which must be a power of two not exceeding 16, so the
	// valid settings are 1 (the default), 2, 4, 8, 16. At 16, the clock
	// ticks once every 16 seconds which means that __pi_nseconds is going
	// to be incremented by 16 every 16 seconds of real time.
	// Note that any code included in "second.h"/"board_second.h" (like
	// emergency resets and stuff) will be run at the update rate of the
	// clock. [231028]

	// TCI_SEC_DIV can be legitimately 64K (full wrap around) which should
	// quietly translate to zero; hence the cast
	TCI_CCS += (word) TCI_SEC_DIV;

	__pi_nseconds += SECOND_CLOCK_RATE;

	check_stack_overflow;

// ============================================================================
#include "second.h"
// ============================================================================

	RTNI;
}

