senserf/picos/PicOS/MSP430/main.c
#if SECOND_CLOCK_RATE != 1

// When returning the number of seconds (with the second clock being coarse),
// we adjust __pi_nseconds by the number of ticks elapsed since last timer
// setting divided by the number of ticks per second. This is cruder than my
// original plans, but OK, I think. The worst that can happen when we call
// seconds is that the timer is exactly on the target (so we shall spin). The
// tick lasts for up to 256 us, so we may occasionally spin for that much.
// [231028]

lword seconds () {

	word t;
	lword res;

	do {
		cli_sec;
		t = gettav () - TCI_CCS;
		res =  __pi_nseconds;
		sti_sec;

	} while (t == 0);

	return res + (t / TIMER_TICKS_PER_SECOND);
}

#endif

interrupt (TCI_VECTOR) timer_int () {

	// This one serves only delays; utimers are handled by the debounce
	// timer

	cli_tim;
	__pi_new += setdel;
	setdel = 0;	// Mark that the counting has been accomplished
	RISE_N_SHINE;

	RTNI;
}

#else	/* TRIPLE_CLOCK */

// ============================================================================
// Timer interrupt and clock modes for the single clock case ==================
// ============================================================================

// clockdown/clockup are macros defined in mach.h

interrupt (TCI_VECTOR) timer_int () {

	word d;

	// Clear hardware watchdog. Its sole purpose is to guard clock
	// interrupts, with clock interrupts acting as software watchdog.

#if HIGH_CRYSTAL_RATE == 0
	// We have two distinct modes for the clock
	if (TCI_CCR == TCI_INIT_HIGH) {
#endif
		// Power up: one tick == 1 JIFFIE
		/* This code assumes that MAX_UTIMERS is 4 */
#define	UTIMS_CASCADE(x) 	if (__pi_utims [x]) {\
					 if (*(__pi_utims [x]))\
						 (*(__pi_utims [x]))--
		UTIMS_CASCADE(0);
		UTIMS_CASCADE(1);
		UTIMS_CASCADE(2);
		UTIMS_CASCADE(3);
		}}}}
#undef UTIMS_CASCADE

		// Extras
#include "irq_timer.h"

		__pi_new++;

		d = __pi_new - __pi_old;

		if (d >= JIFFIES || twakecnd (__pi_old, __pi_new, __pi_mintk))
			RISE_N_SHINE;

		RTNI;

#if HIGH_CRYSTAL_RATE == 0
	// We actually do have two different modes
	}

	// Here we are running in the SLOW mode: one tick ==
	// JIFFIES/TCI_LOW_PER_SEC

#define	UTIMS_CASCADE(x) \
		if (__pi_utims [x]) { \
		  if (*(__pi_utims [x])) \
		    *(__pi_utims [x]) = *(__pi_utims [x]) > \
		      (JIFFIES/TCI_LOW_PER_SEC) ? \
			*(__pi_utims [x]) - (JIFFIES/TCI_LOW_PER_SEC) : 0

	UTIMS_CASCADE(0);
	UTIMS_CASCADE(1);
	UTIMS_CASCADE(2);
	UTIMS_CASCADE(3);
	}}}}
#undef UTIMS_CASCADE

	__pi_new += JIFFIES/TCI_LOW_PER_SEC;

	d = __pi_new - __pi_old;

#if TCI_LOW_PER_SEC > 1
	if (d >= JIFFIES || twakecnd (__pi_old, __pi_new, __pi_mintk))
#endif
		RISE_N_SHINE;

	RTNI;
#endif	/* HIGH_CRYSTAL_RATE == 0 */
}

#endif	/* TRIPLE_CLOCK */

#if GLACIER

// ============================================================================

#if TRIPLE_CLOCK
#error "S: GLACIER is not compatible (and not needed) with TRIPLE_CLOCK"
#endif

#if HIGH_CRYSTAL_RATE
#error "S: GLACIER is not compatible with HIGH_CRYSTAL_RATE!!"
#endif

// ============================================================================

void freeze (word nsec) {
/*
 * Freezes the system in power-down mode for the specified number of seconds.
 */
	byte saveP1IE, saveP2IE;

#if UART_DRIVER || UART_TCV
	word saveUIE;
#endif
	byte saveLEDsV, saveLEDsB;

	// In case some of these take too long for the clock guard
	cli;

	// Save I/O pin interrupt configuration
	saveP1IE = P1IE;
	saveP2IE = P2IE;
	// And disable them
	P1IE = P2IE = 0x00;

#if LEDS_DRIVER
	// Save leds status and turn them off
	leds_save (saveLEDsV, saveLEDsB);
#endif

#if UART_DRIVER || UART_TCV
	
	// Save and disable UART interrupt configuration
	uart_save_ie_flags (saveUIE);
	uart_a_wait_tx;
#ifdef UART_PREINIT_B
	uart_b_wait_tx;
#endif
#endif
	powerdown ();
	// Save clock state

	while (1) {
		_BIS_SR (LPM3_bits + GIE);
		cli;
		if (nsec == 0)
			break;
		nsec--;
	}

	P1IE = saveP1IE;
	P2IE = saveP2IE;

#if UART_DRIVER || UART_TCV
	// Reset the UART to get it back to normal
	uart_a_reset_on;
	uart_a_reset_off;
#ifdef 	UART_PREINIT_B
	uart_b_reset_on;
	uart_b_reset_off;
#endif
	uart_restore_ie_flags (saveUIE);
#endif
	powerup ();

	// Trigger the interrupts if they are pending
	P1IFG = (P1IE & (P1IES ^ P1IN));
	P2IFG = (P2IE & (P2IES ^ P2IN));

#if LEDS_DRIVER
	leds_restore (saveLEDsV, saveLEDsB);
#endif
	sti;
}

#endif	/* GLACIER */

static void mem_init () {

	__pi_malloc_init ();
}

#if	STACK_GUARD
word __pi_stackfree (void) {

	word sc;
	for (sc = 0; sc < STACK_SIZE / sizeof (word); sc++)
		if (*(((word*)STACK_END) + sc) != STACK_SENTINEL)
			break;
	return sc;
}

#endif

static void ios_init () {

#ifdef	EMERGENCY_STARTUP_CONDITION

	if (EMERGENCY_STARTUP_CONDITION) {
		EMERGENCY_STARTUP_ACTION;
	}
#endif

// ============================================================================
// Praxis-dependent extra initialization ======================================
// ============================================================================

#ifdef	SENSOR_INITIALIZERS
	__pi_init_sensors ();
#endif

#ifdef	ACTUATOR_INITIALIZERS
	__pi_init_actuators ();
#endif

#ifdef	EXTRA_INITIALIZERS
	// Extra initialization
	EXTRA_INITIALIZERS;
#endif

#if	UART_DRIVER || UART_TCV
	// A UART is configured, initialize it beforehand without enabling
	// anything, which is up to the driver plugin. We just want to be able
	// to use diag.
	preinit_uart ();
#endif

#if	DIAG_MESSAGES
	diag ("");

#ifdef	BANNER
	diag (BANNER);
#else
	diag ("PicOS v" SYSVER_S "/" SYSVER_R
#ifdef	SYSVER_B
		"-" SYSVER_B
#endif
        	", (C) Olsonet Communications, 2002-2021");
	diag ("Leftover RAM: %d bytes", (word)STACK_END - (word)(&__BSS_END));
#endif

#endif	/* DIAG_MESSAGES */

	dbg_1 (0x1000 | SYSVER_X);
	dbg_1 ((word)STACK_END - (word)(&__BSS_END)); // RAM in bytes

#if MAX_DEVICES
	/* Initialize devices */
	int i;
	for (i = UART; i < MAX_DEVICES; i++)
		if (devinit [i] . init != NULL)
			devinit [i] . init (devinit [i] . param);
#endif
	/* Make SMCLK/MCLK available on P5.5, P5.4 */
	//_BIS (P5OUT, 0x30);
	//_BIS (P5SEL, 0x30);
}

/* ------------------------------------------------------------------------ */
/* ============================ DEVICE DRIVERS ============================ */
/* ------------------------------------------------------------------------ */

#if	UART_DRIVER || UART_TCV

uart_t	__pi_uart [N_UARTS];

static void preinit_uart () {

#ifdef	UART_PREINIT_A
	// UART_A
	UART_PREINIT_A;
	uart_a_reset_on;
	uart_a_set_clock;
	uart_a_set_rate_def;
	uart_a_set_write_int;
	uart_a_enable;
	uart_a_reset_off;
#if UART_RATE_SETTABLE
	__pi_uart [0] . flags = UART_RATE_INDEX;
#endif

