senserf/picos/PicOS/MSP430/main.c
#endif	/* UART_PREINIT_A */

/*
 * Note: the second UART doesn't want to work at 9600 with the standard slow
 * crystal. The xmitter is OK, but the receiver gets garbage. 4800 is fine. 
 * Also, things seem to work fine (up to 115200) with a high speed crystal.
 */
#ifdef	UART_PREINIT_B
	// UART_B
	UART_PREINIT_B;
	uart_b_reset_on;
	uart_b_set_clock;
	uart_b_set_rate_def;
	uart_b_set_write_int;
	uart_b_enable;
	uart_b_reset_off;
#if UART_RATE_SETTABLE
	__pi_uart [1] . flags = UART_RATE_INDEX;
#endif

#endif	/* UART_PREINIT_B */
}

#if UART_RATE_SETTABLE

static const uart_rate_table_entry_t urates [] = UART_RATE_TABLE;

#define	N_RATES		(sizeof(urates) / sizeof(uart_rate_table_entry_t))

Boolean __pi_uart_setrate (word rate, uart_t *ua) {

	byte j;

	for (j = 0; j < N_RATES; j++) {
		if (rate == urates [j] . rate) {
			// Found
#if N_UARTS > 1
			if (ua != __pi_uart)
				uart_b_set_rate (urates [j]);
			else
#endif	/* N_UARTS */
				uart_a_set_rate (urates [j]);
			ua->flags = (ua->flags & ~UART_RATE_MASK) | j;
			return YES;
		}
	}
	return NO;
}

word __pi_uart_getrate (uart_t *ua) {

	return urates [ua->flags & UART_RATE_MASK] . rate;
}

#endif 	/* UART_RATE_SETTABLE */

#endif	/* UART_DRIVER || UART_TCV */

// ============================================================================

#if	UART_DRIVER
/* ======== */
/* The UART */
/* ======== */

#define	uart_write8(u,w) \
	__usel (u, uart_b_write (w), uart_a_write (w))

#define uart_enable_write_int(u) __usel (u, uart_b_enable_write_int, \
						uart_a_enable_write_int)

#define uart_disable_int(u)	__usel (u, uart_b_disable_int, \
						uart_a_disable_int)

#define uart_disable_read_int(u) __usel (u, uart_b_disable_read_int, \
						uart_a_disable_read_int)

#define uart_disable_write_int(u) __usel (u, uart_b_disable_write_int, \
						uart_a_disable_write_int)

#define	uart_read(u)		__ualt (u, uart_b_read, uart_a_read)

#define uart_enable_read_int(u)	__usel (u, uart_b_enable_read_int, \
						uart_a_enable_read_int)

/* ======================= */
/* Common request function */
/* ======================= */
static INLINE int ioreq_uart (uart_t *u, int operation, char *buf, int len) {

	switch (operation) {

		case READ:

#if UART_INPUT_BUFFER_LENGTH > 1
			uart_disable_read_int (u);
			if (u->ib_count == 0) {
				// The buffer is empty
				_BIS (u->flags, UART_FLAGS_IN);
				return -2;
			}
			_BIC (u->flags, UART_FLAGS_IN);
			uart_enable_read_int (u);
			operation = len;
			while (len) {
				uart_disable_read_int (u);
				if (u->ib_count == 0) {
					uart_enable_read_int (u);
					break;
				}
				u->ib_count--;
				uart_enable_read_int (u);
				*buf++ = u->in [u->ib_out];
				if (++(u->ib_out) == UART_INPUT_BUFFER_LENGTH)
					u->ib_out = 0;
				len--;
			}
			return operation - len;
#else
			if ((u->flags & UART_FLAGS_IN)) {
				// Receive interrupt is disabled
R_redo:
				*buf = u->in;
				_BIC (u->flags, UART_FLAGS_IN);
				uart_enable_read_int (u);
				return 1;
			}
			uart_disable_read_int (u);
			if ((u->flags & UART_FLAGS_IN))
				// Account for the race
				goto R_redo;
			// The buffer is empty
			return -2;
#endif
		case WRITE:

#if defined(blue_ready) && defined(BLUETOOTH_UART)
			// Bluetooth on UART
			if (
#if N_UARTS > 1
				// There is a choice of UARTs, have to check if
				// this is the one
				u
#if BLUETOOTH_UART == 0
				   // BT on UART 0
				   ==
#else
				   // BT on UART 1
				   !=
#endif	/* UART 0 or 1 */
				      __pi_uart &&
#endif	/* Multiple UARTs */
					(u->flags & UART_FLAGS_NOTRANS) == 0 &&
					  // BT must be connected
					  !blue_ready)
								return 1;
#endif	/* Transparent BT */
			if ((u->flags & UART_FLAGS_OUT) == 0) {
X_redo:
				u->out = *buf;
				_BIS (u->flags, UART_FLAGS_OUT);
				uart_enable_write_int (u);
				return 1;
			}
			uart_disable_write_int (u);
			if ((u->flags & UART_FLAGS_OUT) == 0)
				goto X_redo;
			return -2;
					
		case NONE:

			// Cleanup
#if UART_INPUT_BUFFER_LENGTH < 2
			if ((u->flags & UART_FLAGS_IN) == 0) {
				uart_enable_read_int (u);
			}
#else
				uart_enable_read_int (u);
#endif
			if ((u->flags & UART_FLAGS_OUT))
				uart_enable_write_int (u);

			return 0;

		case CONTROL:

#if UART_RATE_SETTABLE
			if (len == UART_CNTRL_SETRATE) {
				if (__pi_uart_setrate (*((word*)buf), u))
						return 1;
				syserror (EREQPAR, "uar");
			}

			if (len == UART_CNTRL_GETRATE) {
				*((word*)buf) = __pi_uart_getrate (u);
				return 1;
			}
#endif

#ifdef blue_ready
			if (len == UART_CNTRL_TRANSPARENT) {
				if (*((word*)buf))
					_BIC (u->flags, UART_FLAGS_NOTRANS);
				else
					_BIS (u->flags, UART_FLAGS_NOTRANS);
				return 1;
			}
#endif
			/* Fall through */
		default:
			syserror (ENOOPER, "uai");
			/* No return */
			return 0;
	}
}

/* ========================== */
/* Interrupt service routines */
/* ========================== */

#ifdef	UART_A_TX_RX_VECTOR
//
// This means that there is a single vector for both RX and TX, as in CC430
//
interrupt (UART_A_TX_RX_VECTOR) uart_a_tx_rx_int (void) {

	if (uart_a_tx_interrupt) {

// ============================================================================

#else

interrupt (UART_A_TX_VECTOR) uart_a_tx_int (void) {

// ============================================================================

#endif

// ============================================================================
// TX interrupt service =======================================================
// ============================================================================

	// Disable until a character arrival
	uart_a_disable_write_int;

#if NESTED_INTERRUPTS
	// Enable other interrupts. Note: we do this only for UART0.
	sti;
#endif
	RISE_N_SHINE;

	if ((__pi_uart [0] . flags & UART_FLAGS_OUT) == 0) {
		// Keep the interrupt pending
		uart_a_set_write_int;
	} else {
		_BIC (__pi_uart [0] . flags, UART_FLAGS_OUT);
		uart_a_write (__pi_uart [0] . out);
	}
	i_trigger (devevent (UART_A, WRITE));
	RTNI;
}

#ifdef UART_A_TX_RX_VECTOR

	else {

#else

interrupt (UART_A_RX_VECTOR) uart_a_rx_int (void) {

#endif

// ============================================================================
// RX interrupt service =======================================================
// ============================================================================

#define	ua	(__pi_uart + 0)

